; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	instrument16 - instrument
	satellite8 - satellite
	instrument17 - instrument
	satellite9 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	satellite10 - satellite
	instrument21 - instrument
	instrument22 - instrument
	thermograph1 - mode
	infrared0 - mode
	Star3 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument7 infrared0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star2)
	(supports instrument10 thermograph1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star0)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star2)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star7)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 thermograph1)
	(supports instrument13 infrared0)
	(calibration_target instrument13 Star3)
	(supports instrument14 infrared0)
	(supports instrument14 thermograph1)
	(calibration_target instrument14 GroundStation4)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star7)
	(supports instrument15 infrared0)
	(supports instrument15 thermograph1)
	(calibration_target instrument15 GroundStation4)
	(supports instrument16 thermograph1)
	(supports instrument16 infrared0)
	(calibration_target instrument16 Star3)
	(on_board instrument15 satellite7)
	(on_board instrument16 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star0)
	(supports instrument17 thermograph1)
	(supports instrument17 infrared0)
	(calibration_target instrument17 Star3)
	(on_board instrument17 satellite8)
	(power_avail satellite8)
	(pointing satellite8 GroundStation1)
	(supports instrument18 infrared0)
	(supports instrument18 thermograph1)
	(calibration_target instrument18 Star0)
	(supports instrument19 infrared0)
	(calibration_target instrument19 Star0)
	(supports instrument20 infrared0)
	(supports instrument20 thermograph1)
	(calibration_target instrument20 GroundStation1)
	(on_board instrument18 satellite9)
	(on_board instrument19 satellite9)
	(on_board instrument20 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Planet6)
	(supports instrument21 infrared0)
	(supports instrument21 thermograph1)
	(calibration_target instrument21 GroundStation4)
	(supports instrument22 thermograph1)
	(supports instrument22 infrared0)
	(calibration_target instrument22 Star2)
	(on_board instrument21 satellite10)
	(on_board instrument22 satellite10)
	(power_avail satellite10)
	(pointing satellite10 Star10)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite3 GroundStation1)
	(pointing satellite4 Star3)
	(pointing satellite5 GroundStation4)
	(pointing satellite8 Phenomenon5)
	(pointing satellite9 GroundStation1)
	(pointing satellite10 Phenomenon8)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 thermograph1)
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
))

)

; plan
1. (turn_to satellite8 phenomenon5 groundstation1)
   deleted: (pointing satellite8 groundstation1)
   added: (pointing satellite8 phenomenon5)
   goals met: 2 of 13
2. (turn_to satellite5 groundstation4 star7)
   deleted: (pointing satellite5 star7)
   added: (pointing satellite5 groundstation4)
   goals met: 3 of 13
3. (turn_to satellite4 star3 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 star3)
   goals met: 4 of 13
4. (turn_to satellite10 groundstation4 star10)
   deleted: (pointing satellite10 star10)
   added: (pointing satellite10 groundstation4)
   goals met: 4 of 13
5. (switch_on instrument21 satellite10)
   deleted: (power_avail satellite10)
   added: (power_on instrument21)
   goals met: 4 of 13
6. (calibrate satellite10 instrument21 groundstation4)
   added: (calibrated instrument21)
   goals met: 4 of 13
7. (turn_to satellite10 planet9 groundstation4)
   deleted: (pointing satellite10 groundstation4)
   added: (pointing satellite10 planet9)
   goals met: 4 of 13
8. (take_image satellite10 planet9 instrument21 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 5 of 13
9. (turn_to satellite10 planet6 planet9)
   deleted: (pointing satellite10 planet9)
   added: (pointing satellite10 planet6)
   goals met: 5 of 13
10. (take_image satellite10 planet6 instrument21 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 6 of 13
11. (turn_to satellite10 phenomenon5 planet6)
   deleted: (pointing satellite10 planet6)
   added: (pointing satellite10 phenomenon5)
   goals met: 6 of 13
12. (turn_to satellite1 groundstation1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation1)
   goals met: 7 of 13
13. (take_image satellite10 phenomenon5 instrument21 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 8 of 13
14. (turn_to satellite10 star10 phenomenon5)
   deleted: (pointing satellite10 phenomenon5)
   added: (pointing satellite10 star10)
   goals met: 8 of 13
15. (take_image satellite10 star10 instrument21 infrared0)
   added: (have_image star10 infrared0)
   goals met: 9 of 13
16. (turn_to satellite10 star7 star10)
   deleted: (pointing satellite10 star10)
   added: (pointing satellite10 star7)
   goals met: 9 of 13
17. (take_image satellite10 star7 instrument21 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 10 of 13
18. (turn_to satellite10 phenomenon8 star7)
   deleted: (pointing satellite10 star7)
   added: (pointing satellite10 phenomenon8)
   goals met: 11 of 13
19. (take_image satellite10 phenomenon8 instrument21 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 12 of 13
20. (turn_to satellite9 groundstation1 planet6)
   deleted: (pointing satellite9 planet6)
   added: (pointing satellite9 groundstation1)
   goals met: 13 of 13
